Autodesk.Revit.DB.Architecture.RailSupportJustification
The justification of the rail supports.
Since:
2013

Autodesk.Revit.DB.Architecture.RailSupportJustification.End
Supports are justified to the end of the rail.

Autodesk.Revit.DB.Architecture.RailSupportJustification.Center
Supports are justified to the center of the rail.

Autodesk.Revit.DB.Architecture.RailSupportJustification.Begin
Supports are justified to the beginning of the rail.